

def deck():
    for i in range(2,15):
        """
        создаёт упорядоченную колоду карт.
        """
        if i == 11 :
            i = "Валет"
        elif i == 12 :
            i = "Дама"
        elif i == 13 :
            i = "Король"
        elif i == 14 :
            i = "Туз"
    
        yield (i,"червы"),(i,"бубны"),(i,"крести"),(i,"пики")
        

gen = deck()

print(gen)
print(next(gen))
print(next(gen))
print(list(deck())[::13])

for x in gen:
    print(x)

#<generator object deck at 0x000001A982339FC0>
#((2, 'червы'), (2, 'бубны'), (2, 'крести'), (2, 'пики'))
#((3, 'червы'), (3, 'бубны'), (3, 'крести'), (3, 'пики'))
#[((2, 'червы'), (2, 'бубны'), (2, 'крести'), (2, 'пики'))]

