
from utils import important_message, width,width_start_end,width_none

def main() -> None:
    "запрашивает у пользователя сообщение и выводит его с помощью функции important_message из другого модуля"

    start_text = ("#"+width_start_end+"#\n"+"#"+width_none+"#\n"+"#"+"ЗАГОЛОВОК ПРОГРАММЫ".center(width)+"#\n"+"#"+width_none+"#\n"+"#"+width_start_end+"#")
    print(start_text)

    message = input("Введите сообщение : ")

    important_message(messasge=message)

main()

"""
#========================================================================================================================================#
#                                                                                                                                        #
#                                                          ЗАГОЛОВОК ПРОГРАММЫ                                                           #
#                                                                                                                                        #
#========================================================================================================================================#
Введите сообщение : Привет
#========================================================================================================================================#
#                                                                                                                                        #
#                                                                 Привет                                                                 #
#                                                                                                                                        #
#========================================================================================================================================#

"""